Import Mill

In [1]:
from millclient import *

Create channel and client
MillService should be runing on locahost:9090 TLS must be disabled

In [2]:
client = create_client(url="http://localhost:7071/api/")

Create query and execute to pandas
In notebooks only async version of methods can be used

In [3]:
q1 = await client.sql_query(sql = "SELECT * FROM `ts`.`TEST` ", fetch_size = 10).to_pandas_async()
display(q1.head(10))

,ID,FIRST_NAME,LAST_NAME,PREMIUM,AGE,AMOUNT,ACCOUNT
0,1,Barbee,Bonallick ...,True,15,5654,5016
1,2,Aldon,Zecchii ...,False,2,3622,6614
2,3,Kennett,Prozescky ...,False,67,2810,9799
3,4,Esra,Lukash ...,False,75,2019,816
4,5,Enos,Spohr ...,False,85,7387,6381
5,6,Melita,Iwanowicz ...,True,28,6785,9326
6,7,Candice,Roubert ...,False,74,3416,1920
7,8,Iona,Corain ...,True,6,1702,908
8,9,Harrison,Minogue ...,True,78,170,3559
9,10,Georgeanna,Nimmo ...,True,21,1792,5810